### 데이터 프레임 데이터 조작

In [2]:
import numpy as np 
import pandas as pd

- 데이터 갯수 세기

In [3]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
s.count()

9

In [5]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [6]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [7]:
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [9]:
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [10]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

- 정렬

In [11]:
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [12]:
df[0].sort_values()

2    1.0
3    2.0
1    3.0
0    4.0
Name: 0, dtype: float64

In [13]:
df[0].sort_values(ascending=False)

0    4.0
1    3.0
3    2.0
2    1.0
Name: 0, dtype: float64

In [14]:
df[3].sort_values()

1    1.0
3    1.0
0    4.0
2    NaN
Name: 3, dtype: float64

In [15]:
df.sort_values(by=0)

     0    1    2    3
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0
1  3.0  0.0  4.0  1.0
0  4.0  1.0  0.0  4.0

In [16]:
titanic.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [17]:
titanic.embarked.value_counts().sort_index()

C    168
Q     77
S    644
Name: embarked, dtype: int64

In [18]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [19]:
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [20]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  4  5  9  0  6  5  8  6      43
1  6  6  6  1  5  7  1  1      33
2  5  2  0  3  1  0  2  6      19
3  4  8  5  1  6  7  5  6      42

In [21]:
df2.sum()

0          19
1          21
2          20
3           5
4          18
5          19
6          16
7          19
RowSum    137
dtype: int64

In [22]:
df2.mean()

0          4.75
1          5.25
2          5.00
3          1.25
4          4.50
5          4.75
6          4.00
7          4.75
RowSum    34.25
dtype: float64

In [23]:
df2.std()

0          0.957427
1          2.500000
2          3.741657
3          1.258306
4          2.380476
5          3.304038
6          3.162278
7          2.500000
RowSum    11.116804
dtype: float64

In [24]:
df2.describe()

,0,1,2,3,4,5,6,7,RowSum
count,4.000000,4.00,4.000000,4.000000,4.000000,4.000000,4.000000,4.00,4.000000
mean,4.750000,5.25,5.000000,1.250000,4.500000,4.750000,4.000000,4.75,34.250000
std,0.957427,2.50,3.741657,1.258306,2.380476,3.304038,3.162278,2.50,11.116804
min,4.000000,2.00,0.000000,0.000000,1.000000,0.000000,1.000000,1.00,19.000000
25%,4.000000,4.25,3.750000,0.750000,4.000000,3.750000,1.750000,4.75,29.500000
50%,4.500000,5.50,5.500000,1.000000,5.500000,6.000000,3.500000,6.00,37.500000
75%,5.250000,6.50,6.750000,1.500000,6.000000,7.000000,5.750000,6.00,42.250000
max,6.000000,8.00,9.000000,3.000000,6.000000,7.000000,8.000000,6.00,43.000000

- apply 변환

In [25]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [26]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [27]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [28]:
titanic['adult/child'] = titanic.apply(
    lambda r: 'adult' if r.age >= 20 else 'child', axis=1
)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

- fillna

In [29]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [30]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

- astype 메소드

In [31]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

- 실수 값을 카테고리 값으로 변환

In [33]:
ages = [0, 2, 18, 20, 23, 37, 31, 61, 21, 41, 32, 101]

In [34]:
bins = [1, 18, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '청년', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [35]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [36]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q3', 'Q4', 'Q1', 'Q1', ..., 'Q1', 'Q2', 'Q1', 'Q3', 'Q1']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [37]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64